Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.BCRehostedFromOpeningToPanel Property
 Boundary Conditions were re-hosted from the Analytical Opening to the Analytical Panel during upgrade.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BCRehostedFromOpeningToPanel { get; }
Public Shared ReadOnly Property BCRehostedFromOpeningToPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BCRehostedFromOpeningToPanel {
	FailureDefinitionId^ get ();
}
static member BCRehostedFromOpeningToPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace